bench/results/20260917T203432Z-cursor-scaled20/raw/light/http/rust/round2/c200.wrk.txt
Running 30s test @ http://127.0.0.1:18300/
  1 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.18ms  703.06us   7.40ms   88.21%
    Req/Sec    36.87k     2.03k   41.21k    67.22%
  Latency Distribution
     50%    1.02ms
     75%    1.32ms
     90%    1.76ms
     99%    3.80ms
  1101602 requests in 30.04s, 299.41MB read
Requests/sec:  36676.10
Transfer/sec:      9.97MB